Revit 2026 API

# FamilySymbolFilter Class

---

A filter used to find all family symbols of the given family.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBFamilySymbolFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySymbolFilter : ElementQuickFilter
```
```vb
Public Class FamilySymbolFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class FamilySymbolFilter : public ElementQuickFilter
```
```fsharp
type FamilySymbolFilter =
    class
        inherit ElementQuickFilter
    end
```

The FamilySymbolFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilySymbolFilter | Constructs a new instance of a filter to find all family symbols of the given family. |

|  | Name | Description |
| --- | --- | --- |
|  | FamilyId | The family id. |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

Note that it may be faster to get a list of symbol ids from GetFamilySymbolIds rather than to iterate all of the contents of a document with this filter applied.

#### Reference

Autodesk.Revit.DB Namespace